Repository: foqerhk/KoKoApp
Catalog: ios/KoKo/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %@ CLI install did not finish successfully on the server
zh_hans: 服务器上 %@ CLI 安装未成功完成

source: %@ is not signed in
zh_hans: %@ 尚未登录

source: %@ · ~%dp · %dfps
zh_hans: %@ · 约 %dp · %dfps

source: %@, %@, %lld bars
zh_hans: %@，%@，信号 %lld 格

source: %@, Wi‑Fi, %lld bars
zh_hans: %@，Wi‑Fi，信号 %lld 格

source: %d%% of host · %dfps
zh_hans: 主机分辨率 %d%% · %dfps

source: %lld ms · %.1f%% loss · %lld kbps · %.0ffps · %@ · %@
zh_hans: %lld 毫秒 · %.1f%% 丢包 · %lld kbps · %.0ffps · %@ · %@

source: %lld ms · %.1f%% loss · %lld kbps · %@
zh_hans: %lld 毫秒 · 丢包 %.1f%% · %lld kbps · %@

source: %lld ms · %.1f%% loss · %lld kbps · %@ · %@
zh_hans: %lld 毫秒 · %.1f%% 丢包 · %lld kbps · %@ · %@

source: %lld ms · %.1f%% · %lld kb/s · %.0ffps · %@
zh_hans: %lld 毫秒 · %.1f%% · %lld kb/s · %.0ffps · %@

source: About
zh_hans: 关于

source: Absolute Mouse
zh_hans: 绝对鼠标

source: Add Project
zh_hans: 添加项目

source: Add SSH Host
zh_hans: 添加 SSH 主机

source: Add a Linux server to connect Cursor Agent over SSH
zh_hans: 添加 Linux 服务器以通过 SSH 连接 Cursor Agent

source: Add a host and project path first
zh_hans: 请先添加主机和项目路径

source: Add an SSH host or pair a desktop Agent first
zh_hans: 请先添加 SSH 主机，或配对桌面 Agent

source: Add an SSH server or pair a RunEverything agent
zh_hans: 添加 SSH 主机，或配对 RunEverything Agent

source: Add an SSH server to connect AI agents over screen or Cursor persist
zh_hans: 添加 SSH 服务器，通过 screen 或 Cursor persist 连接 AI Agent

source: Add an SSH server, or scan an Agent QR to pair a remote desktop.
zh_hans: 添加 SSH 服务器，或扫描 Agent 二维码配对远程桌面。

source: Address
zh_hans: 地址

source: Affects KoKo UI only. Terminal / agent output follows the remote session.
zh_hans: 仅影响 KoKo 界面；终端 / Agent 输出仍跟随远端会话。

source: After you trust it, KoKo will finish installing the public key and switch this host to key login.
zh_hans: 信任后，KoKo 会继续安装公钥，并把该主机切换为密钥登录。

source: Agent did not answer the data channel handshake. If the remote desktop is open on another phone, close it there and retry.
zh_hans: Agent 未响应数据通道握手。如果另一台手机正在使用远程桌面，请先关闭后重试。

source: Agent identity changed. Re-scan the current QR to re-pair.
zh_hans: Agent 身份已变更。请重新扫描当前二维码以再次配对。

source: Agent identity mismatch (noise_pub)
zh_hans: Agent 身份不匹配（noise_pub）

source: Agent is offline
zh_hans: Agent 离线

source: Agent is offline. Wake the PC or re-scan when it is online.
zh_hans: Agent 离线。请唤醒电脑，或在其上线后重新扫描。

source: Agent re-paired or session credentials no longer match. Scan a fresh QR.
zh_hans: Agent 已重新配对或会话凭证失效。请扫描新的二维码。

source: Algorithm
zh_hans: 算法

source: Another client is using this Agent. Close it there, then reconnect from Hosts.
zh_hans: 其他客户端正在使用此 Agent。请先关闭那边的连接，再从「主机」重连。

source: Another client is using this Agent. Close it there, then tap Reconnect.
zh_hans: 其他客户端正在使用此 Agent。请先关闭那边，再点重连。

source: Another client may be connected. Close it there, then tap Reconnect.
zh_hans: 可能有其他客户端已连接。请先关闭那边，再点重连。

source: Appearance
zh_hans: 外观

source: Applies to KoKo UI on iPhone, Duo, and iPad. Terminal colors stay dark for readability.
zh_hans: 作用于 iPhone、Duo、iPad 的 KoKo 界面。终端为便于阅读保持深色。

source: Applying quality…
zh_hans: 正在切换画质…

source: Ask the Agent to print a fresh QR (do not reuse an old terminal QR after reconnect).
zh_hans: 请让 Agent 重新打印二维码（重连后不要继续用终端里旧的码）。

source: Auth
zh_hans: 认证

source: Authenticating…
zh_hans: 正在认证…

source: Authentication
zh_hans: 认证

source: Authorization code
zh_hans: 授权码

source: Auto
zh_hans: 自动

source: Back Camera
zh_hans: 后置摄像头

source: Background
zh_hans: 后台

source: Balanced
zh_hans: 标清

source: Best for this link
zh_hans: 带宽允许下最高画质

source: Best quality
zh_hans: 最佳画质

source: Bind failed
zh_hans: 绑定失败

source: Binding timed out. Check network / Agent online, then reconnect.
zh_hans: 绑定超时。请检查网络或 Agent 是否在线，然后重连。

source: Binding…
zh_hans: 正在绑定…

source: Build time is stamped on each install so you can confirm the latest sync.
zh_hans: 每次构建都会写入时间戳，便于确认是否为最新同步版本。

source: Camera
zh_hans: 摄像头

source: Camera Unavailable
zh_hans: 无法使用相机

source: Camera permission denied
zh_hans: 未授予相机权限

source: Cancel
zh_hans: 取消

source: Cancelled
zh_hans: 已取消

source: Cellular
zh_hans: 蜂窝

source: Changed Files
zh_hans: 改动的文件

source: Checking server outbound network…
zh_hans: 正在检测服务器出网…

source: Checking/installing Node.js/npm on server…
zh_hans: 正在检查/安装服务器上的 Node.js/npm…

source: Choose Session
zh_hans: 选择会话

source: Choose a conversation to run an agent here.
zh_hans: 选择一个对话，在此运行 Agent。

source: Choose which SSH host should receive this public key.
zh_hans: 选择要把公钥安装到哪台 SSH 主机。

source: Claude Login
zh_hans: Claude 登录

source: Clear
zh_hans: 清理

source: Clear All Session History
zh_hans: 清理全部会话历史

source: Clear all scrollback?
zh_hans: 清理全部 scrollback？

source: Client
zh_hans: 客户端

source: Client · %@
zh_hans: 客户端 · %@

source: Close Remote Desktop Camera
zh_hans: 关闭远程桌面的摄像头

source: Close pane
zh_hans: 关闭窗格

source: Code sent to server terminal
zh_hans: 已发送到服务器终端

source: Codex Login
zh_hans: Codex 登录

source: Confirm host fingerprint to continue…
zh_hans: 请确认主机指纹以继续…

source: Confirm the server host key fingerprint
zh_hans: 请确认服务器主机密钥指纹

source: Connect
zh_hans: 连接

source: Connected
zh_hans: 已连接

source: Connecting LAN…
zh_hans: 正在连接局域网…

source: Connecting UDP…
zh_hans: 正在连接 UDP…

source: Connecting to server…
zh_hans: 正在连接服务器…

source: Connecting…
zh_hans: 正在连接…

source: Connection
zh_hans: 连接

source: Connection Failed
zh_hans: 连接失败

source: Connection lost
zh_hans: 连接已断开

source: Connection timed out. Check the network, then tap Reconnect.
zh_hans: 连接超时。请检查网络后点「重新连接」。

source: Connections are blocked if the fingerprint changes. Verify it with your server admin.
zh_hans: 指纹变化时将阻止连接。请与服务器管理员核对。

source: Controls
zh_hans: 控件

source: Copy Code
zh_hans: 复制验证码

source: Copy Link
zh_hans: 复制链接

source: Copy Public Key
zh_hans: 复制公钥

source: Copy the link and sign in in your browser. Switch back to KoKo when done — the session reconnects automatically.
zh_hans: 复制链接到浏览器完成登录，完成后切回 KoKo 即可自动重新连接。

source: Copy the link, sign in with a browser, then return to the app and reconnect.
zh_hans: 复制链接到浏览器完成登录，完成后回到 App 重新连接。

source: Could not enable public-key login on the server
zh_hans: 无法开启服务器公钥登录

source: Could not install Node.js/npm on the server
zh_hans: 无法在服务器上安装 Node.js/npm

source: Could not parse agent conversation list from server
zh_hans: 无法解析服务器返回的 Agent 对话列表

source: Could not parse agent session list from server
zh_hans: 无法解析服务器返回的 Agent 会话列表

source: Could not resolve remote home directory
zh_hans: 无法解析远端用户主目录

source: Create
zh_hans: 创建

source: Create a tmux / agent persist session to start Cursor Agent
zh_hans: 连接服务器上的 Cursor Agent（agent persist）

source: Cursor Login
zh_hans: Cursor 登录

source: Cursor is not signed in
zh_hans: Cursor 尚未登录

source: Cursor uses agent persist. Claude, Codex, and Gemini run inside a named GNU screen session on the server.
zh_hans: Cursor 使用 agent persist。Claude、Codex、Gemini 在服务器上的具名 GNU screen 会话中运行。

source: Dark
zh_hans: 深色

source: Delete
zh_hans: 删除

source: Delete %@ from this device? The private key will be removed from Keychain and cannot be recovered.
zh_hans: 要从本机删除“%@”吗？私钥将从 Keychain 移除且无法恢复。

source: Delete %@ from this device? The remote tmux / agent is not terminated.
zh_hans: 要从本机删除“%@”吗？远端 agent persist 不会被终止。

source: Delete %@ on the server and on this device? This cannot be undone.
zh_hans: 删除“%@”在服务器和本机上的会话？此操作不可撤销。

source: Delete %@? Related sessions on this device will also be removed.
zh_hans: 要删除“%@”吗？本机上的相关会话也会被移除。

source: Delete Host
zh_hans: 删除主机

source: Delete Host?
zh_hans: 删除主机？

source: Delete Key
zh_hans: 删除密钥

source: Delete Key?
zh_hans: 删除密钥？

source: Delete Session
zh_hans: 删除会话

source: Delete Session?
zh_hans: 删除会话？

source: Delete failed
zh_hans: 删除失败

source: Delete in %llds
zh_hans: %lld 秒后可删除

source: Delete the selected conversations on the server and on this device? This cannot be undone.
zh_hans: 删除所选会话在服务器和本机上的记录？此操作不可撤销。

source: Delete the selected hosts? Related sessions on this device will also be removed.
zh_hans: 要删除选中的主机吗？本机上的相关会话也会被移除。

source: Delete the selected keys from this device? Private keys will be removed from Keychain and cannot be recovered.
zh_hans: 要删除选中的密钥吗？私钥将从 Keychain 移除且无法恢复。

source: Deleting %lld of %lld: %@
zh_hans: 正在删除 %lld / %lld：%@

source: Deleting Session
zh_hans: 正在删除会话

source: Desktop
zh_hans: 桌面

source: Desktop closed
zh_hans: 桌面已关闭

source: Desktop did not open in time. Confirm the prompt on the host, then reconnect.
zh_hans: 桌面未能及时打开。请在主机上确认提示后重连。

source: Device
zh_hans: 设备

source: Disable Privacy Blank
zh_hans: 关闭隐私遮罩

source: Disconnect
zh_hans: 断开连接

source: Disconnected
zh_hans: 已断开

source: Disconnected — another client took over this session.
zh_hans: 已断开 — 其他客户端接管了此会话。

source: Disconnected — another client took over this session. Reconnect from Hosts if needed.
zh_hans: 已断开 — 其他客户端接管了此会话。如需继续，请从「主机」重新连接。

source: Display switch failed
zh_hans: 切换显示器失败

source: Displays
zh_hans: 显示器

source: Displays…
zh_hans: 显示器…

source: Do not reuse the old pairing code. Delete this desktop and scan a new Agent QR.
zh_hans: 不要复用旧配对码。请删除此桌面并扫描新的 Agent 二维码。

source: Done
zh_hans: 完成

source: Done signing in, reconnect
zh_hans: 已完成登录，重新连接

source: Drag to reorder
zh_hans: 拖动排序

source: Edit
zh_hans: 编辑

source: Edit Host
zh_hans: 编辑主机

source: Empty Slot %lld
zh_hans: 空槽位 %lld

source: Empty pairing link
zh_hans: 配对链接为空

source: Enabling public-key login on server…
zh_hans: 正在开启服务器公钥登录…

source: Encrypting…
zh_hans: 正在加密…

source: Error
zh_hans: 错误

source: Everyday office
zh_hans: 日常办公

source: Expired
zh_hans: 已过期

source: Files
zh_hans: 文件

source: Files…
zh_hans: 文件…

source: Fingerprint
zh_hans: 指纹

source: Flip Camera
zh_hans: 切换前后摄像头

source: Folder path on the desktop
zh_hans: 桌面上的目录路径

source: Frame timeout
zh_hans: 帧超时

source: Front Camera
zh_hans: 前置摄像头

source: Game Mouse
zh_hans: 游戏鼠标

source: Gemini Login
zh_hans: Gemini 登录

source: Generate
zh_hans: 生成

source: Generate Ed25519 / ECDSA / RSA keys stored in Keychain
zh_hans: 生成 Ed25519 / ECDSA / RSA 密钥并保存在 Keychain

source: Generate Key
zh_hans: 生成密钥

source: Generate an SSH key on the Keys tab first
zh_hans: 请先在「密钥」页生成 SSH 密钥

source: Generated public key is invalid
zh_hans: 生成的公钥无效

source: High
zh_hans: 高清

source: Host
zh_hans: 主机

source: Host Fingerprint
zh_hans: 主机指纹

source: Host has no password or usable key
zh_hans: 主机没有可用的密码或密钥

source: Host has no password or usable key to connect with first
zh_hans: 主机尚无密码或其他可用密钥，无法先登录安装

source: Host key was rejected
zh_hans: 已拒绝主机指纹

source: Host or project path is missing
zh_hans: 缺少主机或项目路径

source: Hosts
zh_hans: 主机

source: IDE extension
zh_hans: IDE 插件

source: If the host shows a permission / privacy dialog, accept it, then tap Reconnect.
zh_hans: 若主机弹出权限/隐私确认，请先同意，再点重连。

source: Initializing terminal…
zh_hans: 正在初始化终端…

source: Install %@ CLI?
zh_hans: 安装 %@ CLI？

source: Install CLI?
zh_hans: 安装 CLI？

source: Install Now
zh_hans: 一键安装

source: Install Public Key
zh_hans: 安装公钥

source: Invalid RE2 frame
zh_hans: 无效的 RE2 帧

source: Invalid RE2 inner message
zh_hans: 无效的 RE2 内部消息

source: Invalid pairing JSON
zh_hans: 无效的配对 JSON

source: Invalid video fragment
zh_hans: 无效的视频分片

source: Keep All
zh_hans: 全部保留

source: Key
zh_hans: 密钥

source: Keys
zh_hans: 密钥

source: KoKo connects to your servers over SSH so you can run Cursor Agent.
zh_hans: KoKo 通过 SSH 连接你的服务器以操作 Cursor Agent。

source: Label
zh_hans: 标签

source: Language
zh_hans: 语言

source: Layout
zh_hans: 布局

source: Light
zh_hans: 浅色

source: Live
zh_hans: 在线

source: Loading conversations… Please wait.
zh_hans: 正在加载会话，请稍候…

source: Login link
zh_hans: 登录链接

source: Maximize pane
zh_hans: 最大化窗格

source: Method
zh_hans: 方式

source: Missing session ticket
zh_hans: 缺少会话票据

source: Mode
zh_hans: 模式

source: Model
zh_hans: 模型

source: More
zh_hans: 更多

source: Name
zh_hans: 名称

source: Need sudo (password) to turn on PubkeyAuthentication in sshd_config
zh_hans: 需要 sudo 密码才能在 sshd_config 中开启 PubkeyAuthentication

source: Network changed — reconnecting…
zh_hans: 网络已切换，正在重连…

source: Network glitch during encryption handshake. Tap Reconnect to retry.
zh_hans: 加密握手时网络异常。请点重连重试。

source: Network poor · holding picture
zh_hans: 网络较差 · 保持画面

source: Network unavailable…
zh_hans: 网络不可用…

source: New
zh_hans: 新建

source: New Agent Chat
zh_hans: 新 Agent 对话

source: New Agent Session
zh_hans: 新建 Agent 会话

source: New CLI Session in This Project
zh_hans: 在此项目新开 CLI 会话

source: New Conversation
zh_hans: 新对话

source: New Host
zh_hans: 新主机

source: New Session
zh_hans: 新建会话

source: New Window
zh_hans: 新窗口

source: New file
zh_hans: 新文件

source: No Conversations
zh_hans: 暂无对话

source: No Hosts
zh_hans: 暂无主机

source: No Keys
zh_hans: 暂无密钥

source: No Session
zh_hans: 无会话

source: No Sessions
zh_hans: 暂无会话

source: No UDP endpoint
zh_hans: 无 UDP 端点

source: No camera available
zh_hans: 没有可用摄像头

source: No projects configured
zh_hans: 尚未配置项目目录

source: Not connected to Agent
zh_hans: 尚未连接到 Agent

source: OK
zh_hans: 好

source: Offline
zh_hans: 离线

source: One-time code
zh_hans: 一次性验证码

source: Only SSH hosts support public key install
zh_hans: 仅 SSH 主机支持安装公钥

source: Only SSH hosts support syncing agent conversations
zh_hans: 仅 SSH 主机支持同步 Agent 对话

source: Open Remote Desktop Camera
zh_hans: 打开远程桌面的摄像头

source: Open in Browser
zh_hans: 在浏览器打开

source: Open in New Window
zh_hans: 在新窗口打开

source: Open the link and sign in. Copy the authorization code from the browser, then paste it into the server terminal with the button below.
zh_hans: 在浏览器打开链接并完成登录，复制 authorization code，再点击下方按钮粘贴到服务器终端。

source: Open the link and sign in. Copy the authorization code, paste it to the server with the button below. If you leave KoKo for the browser, switch back to reconnect automatically, then paste the code.
zh_hans: 打开链接完成登录，复制 authorization code 后点下方按钮粘贴到服务器。若切出 App 去浏览器，切回后会自动重连，再粘贴授权码即可。

source: Open the link and sign in. Paste the authorization code into the field below, then tap Send to server terminal.
zh_hans: 打开链接完成登录，将 authorization code 粘贴到下方输入框，再点「发送到服务器终端」。

source: Open the link in a browser, enter the one-time code, then return here and tap the button below to reconnect.
zh_hans: 在浏览器打开链接并输入一次性验证码，完成后回到 App，点击下方按钮重新连接。

source: Open the link in your browser and enter the one-time code there. Switch back to KoKo when done — the session reconnects automatically.
zh_hans: 在浏览器打开链接并输入一次性验证码，完成后切回 KoKo 即可自动重新连接。

source: Opening desktop…
zh_hans: 正在打开桌面…

source: Opening desktop… Confirm on the host if prompted.
zh_hans: 正在打开桌面…如有提示请在主机上确认。

source: Opens a new chat in Cursor on the desktop for this folder and mirrors it here.
zh_hans: 在桌面的 Cursor 中为该目录新建对话，并同步到手机。

source: Or Paste
zh_hans: 或粘贴

source: Other Sessions
zh_hans: 其他会话

source: Other folder…
zh_hans: 其他目录…

source: P2P
zh_hans: 直连

source: Pair
zh_hans: 配对

source: Pair Desktop
zh_hans: 配对桌面

source: Pair RunEverything
zh_hans: 配对 RunEverything

source: Pairing QR expired — scan again
zh_hans: 配对二维码已过期 — 请重新扫描

source: Pairing QR expired. Generate a new QR on the Agent and scan again.
zh_hans: 配对二维码已过期。请在 Agent 上生成新二维码并重新扫描。

source: Pairing QR uses a LAN-only relay. Join the same Wi‑Fi as the Mac, or refresh the Agent QR with a public relay.
zh_hans: 配对码指向局域网中继。请连上与 Mac 相同的 Wi‑Fi，或在 Agent 刷新带公网中继的二维码后重试。

source: Pairing code is missing %@
zh_hans: 配对码缺少 %@

source: Pairing code is missing relay, device_id, or pairing_token
zh_hans: 配对码缺少 relay、device_id 或 pairing_token

source: Pairing payload
zh_hans: 配对内容

source: Pairing timed out. On cellular you need a public relay QR; on Wi‑Fi join the Mac’s network and retry.
zh_hans: 配对超时。蜂窝网络需使用公网中继二维码；Wi‑Fi 下请加入 Mac 同一网络后重试。

source: Pairing token unknown or superseded. Refresh the QR on the Agent and scan again.
zh_hans: 配对令牌无效或已被替换。请在 Agent 上刷新二维码后重新扫描。

source: Pairing…
zh_hans: 正在配对…

source: Password
zh_hans: 密码

source: Paste Pairing
zh_hans: 粘贴配对

source: Paste Pairing Code
zh_hans: 粘贴配对码

source: Paste QR JSON or koko://pair link
zh_hans: 粘贴二维码 JSON 或 koko://pair 链接

source: Paste to Remote
zh_hans: 粘贴到远程

source: Persistence
zh_hans: 持久化

source: Phone webcam failed on the desktop Agent.
zh_hans: 桌面 Agent 端手机摄像头接入失败。

source: Picture stalled
zh_hans: 画面卡住

source: Platform
zh_hans: 平台

source: Point the camera at the QR from `runeverything pair`, or paste the JSON / koko:// link below.
zh_hans: 对准 `runeverything pair` 显示的二维码，或在下方粘贴 JSON / koko:// 链接。

source: Port
zh_hans: 端口

source: Pre-filled — change only if you want.
zh_hans: 已自动填写，无需改也可直接保存。

source: Primary
zh_hans: 主显示器

source: Privacy Blank
zh_hans: 隐私遮罩

source: Private keys stay in Keychain on this device. Add the public key to the server’s authorized_keys.
zh_hans: 私钥仅保存在本机 Keychain；请将公钥写入服务器 authorized_keys。

source: Project
zh_hans: 项目

source: Projects
zh_hans: 项目目录

source: Public key installed
zh_hans: 公钥已安装

source: Public key is on the server. This host now uses key login in KoKo; the saved password was removed.
zh_hans: 公钥已写入服务器。该主机已在 KoKo 中改为密钥登录，并已清除保存的密码。

source: Public key was written, but key login still failed. Password login was kept.
zh_hans: 公钥已写入，但密钥登录仍失败，已保留密码登录。

source: Public key was written, but key login still failed: %@. Password login was kept.
zh_hans: 公钥已写入，但密钥登录仍失败：%@。已保留密码登录。

source: Pull to refresh — KoKo loads Agent chats from the project directory on the server
zh_hans: 下拉刷新 — KoKo 会从服务器项目目录加载 Agent 对话

source: Pull to refresh — KoKo loads agent sessions and live screen names from the server
zh_hans: 下拉刷新 — KoKo 会从服务器加载 Agent 会话与正在运行的 screen 名称

source: QR scanning needs a device camera. On Simulator, paste the QR JSON instead.
zh_hans: 扫码需要真机相机。模拟器请粘贴二维码 JSON。

source: Quality
zh_hans: 画质

source: Quick Setup on Server
zh_hans: 快捷设置到服务器

source: RE2 frame too large
zh_hans: RE2 帧过大

source: Re-pair
zh_hans: 需重新配对

source: Re-pair required — scan a fresh Agent QR.
zh_hans: 需要重新配对——请扫描 Agent 的新二维码。

source: Recommended
zh_hans: 推荐

source: Reconnect
zh_hans: 重新连接

source: Reconnect failed repeatedly. Re-scan the Agent QR if pairing expired.
zh_hans: 重连多次失败。若配对已过期，请重新扫描 Agent 二维码。

source: Reconnect failed repeatedly. Re-scan the Agent QR if the host refreshed pairing.
zh_hans: 重连多次失败。若主机已刷新配对，请重新扫描 Agent 二维码。

source: Reconnect from Hosts, or scan a new QR if the Agent restarted pairing.
zh_hans: 请从「主机」重连；若 Agent 已重新配对，请扫描新二维码。

source: Reconnecting in %.0fs…
zh_hans: %.0f 秒后重连…

source: Reconnecting video…
zh_hans: 正在恢复画面…

source: Reconnecting…
zh_hans: 正在重连…

source: Refresh
zh_hans: 刷新

source: Reject
zh_hans: 拒绝

source: Relay
zh_hans: 中继

source: Relay is full — try another node or later
zh_hans: 中继已满 — 请换节点或稍后再试

source: Relay memory was cleared. Pair again with a fresh Agent QR.
zh_hans: 中继内存已清空。请用新的 Agent 二维码重新配对。

source: Relay restarted — session ticket is gone. Scan a fresh Agent QR.
zh_hans: 中继已重启，会话票据失效。请扫描新的 Agent 二维码。

source: Remote (Agent xfer)
zh_hans: 远程（Agent 传输）

source: Remote Desktop
zh_hans: 远程桌面

source: Remote Desktop Camera
zh_hans: 远程桌面摄像头

source: Remote Desktop · AI
zh_hans: 远程桌面 · AI

source: Remote command failed (exit %lld)
zh_hans: 远端命令失败（退出码 %lld）

source: Remote path, e.g. /home/user/project
zh_hans: 远端路径，如 /home/user/project

source: Remove %@ from this list? The Agent chat on the server is not deleted.
zh_hans: 从列表移除“%@”？服务器上的 Agent 对话不会被删除。

source: Remove the selected items from this list? Agent chats on the server are not deleted.
zh_hans: 从列表移除所选项目？服务器上的 Agent 对话不会被删除。

source: Removing local cache…
zh_hans: 正在清理本机缓存…

source: Removing remote session data…
zh_hans: 正在删除远端会话数据…

source: Request Keyframe
zh_hans: 请求关键帧

source: Restore pane size
zh_hans: 还原窗格大小

source: Retry P2P
zh_hans: 重试直连

source: Retry reconnect. If it keeps failing, the relay may have restarted — scan a new QR.
zh_hans: 请重试重连。若持续失败，可能是中继已重启 — 请扫描新二维码。

source: Reverts every file this chat changed in Cursor on the computer.
zh_hans: 会在电脑上的 Cursor 中还原此对话改动的所有文件。

source: Run Reload Window in Cursor on the computer to enable mode, model and Keep / Undo.
zh_hans: 请在电脑上的 Cursor 里执行 Reload Window，才能切换模式、模型和使用保留/撤销。

source: SSH Key
zh_hans: SSH 密钥

source: SSH Only
zh_hans: 仅用 SSH

source: SSH Password
zh_hans: SSH 密码

source: SSH authentication failed. Check username / key / password.
zh_hans: SSH 认证失败。请检查用户名 / 密钥 / 密码。

source: SSH authentication failed. Check username / key / password. If you switched to key login, re-run Quick Setup on Server or restore password auth.
zh_hans: SSH 认证失败。请检查用户名 / 密钥 / 密码。若刚改成密钥登录，请重新「快捷设置到服务器」，或暂时改回密码登录。

source: SSH channel could not be opened. Try Reconnect.
zh_hans: 无法打开 SSH 通道，请点重新连接。

source: Save
zh_hans: 保存

source: Scan Desktop QR
zh_hans: 扫描桌面二维码

source: Scan QR
zh_hans: 扫码

source: Scan QR Code
zh_hans: 扫描二维码

source: Scan RunEverything QR
zh_hans: 扫描 RunEverything 二维码

source: Scan a fresh Agent QR from Hosts to re-pair.
zh_hans: 请在「主机」中扫描新的 Agent 二维码以重新配对。

source: Scan the Agent QR code
zh_hans: 扫描 Agent 二维码

source: Scanner Error
zh_hans: 扫码错误

source: Select…
zh_hans: 请选择

source: Send a magic packet via the Agent.
zh_hans: 通过 Agent 发送魔术包。

source: Send authorization code to terminal
zh_hans: 将授权码发送到终端

source: Server did not confirm key install
zh_hans: 服务器未确认公钥安装成功

source: Server did not confirm session deletion
zh_hans: 服务器未确认会话删除成功

source: Server disabled public-key login (PubkeyAuthentication no). Ask the admin to enable it in sshd_config, then retry.
zh_hans: 服务器关闭了公钥登录（PubkeyAuthentication no）。请在 sshd_config 中开启后再试。

source: Server install command failed (exit %lld)
zh_hans: 服务器安装命令失败（退出码 %lld）

source: Server outbound network is restricted — cannot reach %@ install sources. Configure an HTTP/HTTPS proxy on the server, or install the CLI manually on a machine with internet access.
zh_hans: 服务器出网受限，无法访问 %@ 的安装源。请在服务器上配置 HTTP/HTTPS 代理，或在可联网的机器上手动安装 CLI 后同步到服务器。

source: Server rejected host-based authentication.
zh_hans: 服务器拒绝了基于主机的认证。

source: Server rejected key authentication.
zh_hans: 服务器拒绝了密钥认证。

source: Server rejected password authentication.
zh_hans: 服务器拒绝了密码认证。

source: Server “%@” has no %@ CLI. Install it to connect like a Mac terminal, or choose SSH Only for a plain shell.
zh_hans: 服务器「%@」未检测到 %@ 命令行。安装后可像 Mac 终端一样连接；选择「仅用 SSH」则进入普通 shell。

source: Session
zh_hans: 会话

source: Session Info
zh_hans: 会话信息

source: Session List
zh_hans: 会话列表

source: Session Name
zh_hans: 会话名称

source: Session Password
zh_hans: 会话密码

source: Session Unavailable
zh_hans: 会话不可用

source: Session deleted
zh_hans: 会话已删除

source: Session deleted on server and this device.
zh_hans: 服务器和本机上的会话均已删除。

source: Session detail and resume will arrive in a later update. The list is already synced over a data-only Agent channel (no remote desktop video).
zh_hans: 会话详情与恢复稍后实现。当前列表已通过纯数据通道从 Agent 同步（不打开远程桌面画面）。

source: Session missing
zh_hans: 会话不存在

source: Session ticket rejected by relay
zh_hans: 中继拒绝了会话票据

source: Sessions
zh_hans: 会话

source: Settings
zh_hans: 设置

source: Setup complete
zh_hans: 设置完成

source: Setup failed
zh_hans: 设置失败

source: Setup succeeded
zh_hans: 设置成功

source: Smooth
zh_hans: 流畅

source: Smooth mode · weak network
zh_hans: 流畅模式 · 弱网

source: Source
zh_hans: 来源

source: Start Camera
zh_hans: 开启摄像头

source: Start a new agent?
zh_hans: 启动新的 Agent？

source: Starts a new Agent conversation in this project directory. Existing chats appear after refresh.
zh_hans: 在该项目目录启动新的 Agent 对话。已有对话刷新后会出现在列表中。

source: Stop Camera
zh_hans: 关闭摄像头

source: Stop Phone as Webcam
zh_hans: 停止手机当摄像头

source: Stopping remote session…
zh_hans: 正在停止远端会话…

source: Stops the AI process on the desktop. Disconnect only closes this phone's link; the AI keeps running.
zh_hans: 将结束电脑上的 AI 进程。断开连接只会关闭手机这一端，AI 会继续运行。

source: Stops the current remote session and starts a fresh one.
zh_hans: 结束当前远端会话并启动新的会话。

source: Stops the remote agent or screen session on the server. Disconnect only closes this phone's SSH link.
zh_hans: 终止服务器上的 Agent 或 screen 会话。断开连接仅关闭本机 SSH。
